In [1]:
import pandas as pd
import numpy as np
from datetime import datetime, date

In [3]:
df = pd.DataFrame(np.arange(16).reshape(4,4), 
                  columns=['one', 'two', 'three', 'four'], 
                  index=['Ohio', 'Colorado', 'Utah', 'New York'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [11]:
df['three']['Utah'] == df.loc['Utah', 'three'] == df.iloc[2,2] == 10

True

In [17]:
# inner square
df.loc['Colorado':'Utah','two':'three'] == df[['two', 'three']][1:3]

           two  three
Colorado  True   True
Utah      True   True

In [18]:
# select rows based on col value
df[df['one'] > 3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
df['one'] > 3

Ohio        False
Colorado     True
Utah         True
New York     True
Name: one, dtype: bool

In [20]:
df < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [23]:
df[df < 5] = 0
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
# LOC & ILOC
# returns Series
df.loc['Utah', ['one', 'four']] # same as df.iloc[2, [0,3]]

one      8
four    11
Name: Utah, dtype: int64

In [37]:
# this is confusing
# df[['one', 'four']][3] doesnt work!
df[['one', 'four']][2:3]

      one  four
Utah    8    11